pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/USB_UAC_Sound_RateControl/main.c
/*********************************************************************************************************//**
 * @brief  I2S Main Routine.
 * @retval None
 ************************************************************************************************************/
void I2S_MainRoutine(void)
{
  if (UAC_bMuteControl == 0x00)
  {
    I2S_TxMuteCmd(DISABLE);
  }
  else
  {
    I2S_TxMuteCmd(ENABLE);
  }

  if (gI2S_RateProcessDownCnt == 0)
  {
    gI2S_RateProcessDownCnt = 5;

    if (I2SBufLen < I2S_BUF_MID)
    {
      if (I2SPreLen >= I2SBufLen)
      {
        I2S_RateContronIndex += 1;
        if (I2S_RateContronIndex > 1)
        {
          I2S_RateContronIndex = 1;
        }
      }
    }
    else if (I2SBufLen > I2S_BUF_MID)
    {
      if (I2SPreLen <= I2SBufLen)
      {
        I2S_RateContronIndex -= 1;
        if (I2S_RateContronIndex < -1)
        {
          I2S_RateContronIndex = -1;
        }
      }
    }
    else
    {
      I2S_RateContronIndex = 0;
    }

    if (I2S_CurrentRateContronIndex != I2S_RateContronIndex)
    {
      I2S_CurrentRateContronIndex = I2S_RateContronIndex;

      if (I2S_CurrentRateContronIndex > 0)
      {
        HT_I2S->CR |= I2S_RCSEL;
        HT_I2S->RCNTR = I2S_RateControlCounterTable[I2S_CurrentRateContronIndex - 1];
      }
      else if (I2S_CurrentRateContronIndex < 0)
      {
        int tmp = 0 - I2S_CurrentRateContronIndex;
        HT_I2S->CR &= ~I2S_RCSEL;
        HT_I2S->RCNTR = I2S_RateControlCounterTable[tmp - 1];
      }
      else
      {
        HT_I2S->RCNTR = 0;
      }
    }

    #if 0
    {
      static int a;
      static u8 b, c, cc;
      cc =I2SBufLen;
      if ((a != I2S_CurrentRateContronIndex) || (b != I2SPreLen) || (c != cc))
        printf("\r\n%d %u %u", I2S_CurrentRateContronIndex, I2SPreLen, I2SBufLen);

      a = I2S_CurrentRateContronIndex;
      b = I2SPreLen;
      c = cc;
    }
    #endif

    I2SPreLen = I2SBufLen;
  }
}

/*********************************************************************************************************//**
 * @brief  Get I2S Buffer Full state
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool I2S_IsBufferFull(void)
{
  if (I2SBufLen >= I2S_BUF_SIZE)
    return TRUE;
  else
    return FALSE;
}

/*********************************************************************************************************//**
 * @brief  Get I2S Buffer Empty State
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool I2S_IsBufferEmpty(void)
{
  if (I2SBufLen == 0)
    return TRUE;
  else
    return FALSE;
}

/*********************************************************************************************************//**
 * @brief  Write Data into I2S software buffer
 * @retval 0 or I2S_BUF_SIZE
 ************************************************************************************************************/
u32 I2S_BufferWrite(u32* pFrom)
{
  if (I2SBufLen > I2S_BUF_SIZE)
  {
    return 0;
  }
  else
  {
    u32* pTo = (u32*)&I2SBuf[I2SBufWriteIndex][0];
    int i = HALF_BUF_SIZE;

    __set_PRIMASK(1);

    while (i--)
    {
      *pTo = *pFrom;
      pTo++;
      pFrom++;
    }
    I2SBufWriteIndex++;
    if (I2SBufWriteIndex == I2S_BUF_SIZE)
    {
      I2SBufWriteIndex = 0;
    }
    I2SBufLen++;

    __set_PRIMASK(0);

    return I2S_BUF_SIZE;
  }
}

/*********************************************************************************************************//**
 * @brief  Read I2C Software buffer
 * @retval Always 0
 ************************************************************************************************************/
u32 I2S_BufferRead(u32* pTo)
{
  if (I2SBufLen == 0)
  {
    int i = HALF_BUF_SIZE;

    while (i--)
    {
      *pTo = 0x00000000;
      pTo++;
    }

    return 0;
  }
  else
  {
    u32* pFrom = (u32*)&I2SBuf[I2SBufReadIndex][0];
    int i = HALF_BUF_SIZE;

    __set_PRIMASK(1);

    while (i--)
    {
      *pTo = *pFrom;
      pTo++;
      pFrom++;
    }
    I2SBufReadIndex++;
    if (I2SBufReadIndex == I2S_BUF_SIZE)
    {
      I2SBufReadIndex = 0;
    }
    I2SBufLen--;

    __set_PRIMASK(0);

    return I2S_BUF_SIZE;
  }
}

/*********************************************************************************************************//**
 * @brief  WM8978 register read
 * @retval None
 ************************************************************************************************************/
void WM8978_RegWrite(u16 Address, u16 Data)
{
  Address = (Address | Data) >> 8;
  I2CM_BlockedBufferWrite(WM8978_ID, Address, (u8*)&Data, 1);
}

/*********************************************************************************************************//**
 * @brief  Init WM8978.
 * @retval None
 ************************************************************************************************************/
void WM8978_Init(void)
{
  /********************************************
   * Power On Sequence
   ********************************************/
  /* REG_00                                                                                                 */
  WM8978_RegWrite(REG_SOFTWARE_RESET, 0);
  /* REG_34 (Headphone)                                                                                     */
  WM8978_RegWrite(REG_LOUT1_VOL, LOUT1MUTE);
  /* REG_35 (Headphone)                                                                                     */
  WM8978_RegWrite(REG_ROUT1_VOL, ROUT1MUTE);
  /* REG_36 (SPK)                                                                                           */
  WM8978_RegWrite(REG_LOUT2_VOL, LOUT2MUTE);
  /* REG_37 (SPK)                                                                                           */
  WM8978_RegWrite(REG_ROUT2_VOL, ROUT2MUTE);
  /* REG_38                                                                                                 */
  WM8978_RegWrite(REG_OUT3_MIXER, OUT3MUTE);
  /* REG_39                                                                                                 */
  WM8978_RegWrite(REG_OUT4_MIXER, OUT4MUTE);
  /* REG_01                                                                                                 */
  WM8978_RegWrite(REG_POWER_MANAGEMENT1, BUFDCOPEN | BUFIOEN | VMIDSEL_75K | BIASEN | MICBEN);
  /* REG_31                                                                                                 */
  WM8978_RegWrite(REG_OUTPUT, SPKBOOST);
  /* REG_03                                                                                                 */
  WM8978_RegWrite(REG_POWER_MANAGEMENT3, LMIXEN | DACENL | RMIXEN | DACENR | LOUT2EN | ROUT2EN);
  /* REG_02                                                                                                 */
  WM8978_RegWrite(REG_POWER_MANAGEMENT2, LOUT1EN | ROUT1EN | INPPGAENL | INPPGAENR | ADCENL | ADCENR);

  /********************************************
   * Digital Audio Interfaces
   ********************************************/
  /* REG_04                                                                                                 */
  WM8978_RegWrite(REG_AUDIO_INTERFACE, /*FMT_I2S FMT_RIGHT_JUSTIFIED*/ FMT_I2S | WL_16BITS);
  /* REG_06                                                                                                 */
  WM8978_RegWrite(REG_CLOCK_GEN, CLKSEL_MCLK | MCLK_DIV1);

  /********************************************
   * Analogue Sample Rates & Analogue Outputs
   ********************************************/
  /* REG_07                                                                                                 */
#if (SOURCE_TYPE_SEL == SOURCE_TYPE_VOICE)
  WM8978_RegWrite(REG_ADDITIONAL, SR_8KHZ);
#else
  WM8978_RegWrite(REG_ADDITIONAL, SR_48KHZ);
#endif
  /********************************************
   * GPIO
   ********************************************/
  /* REG_08                                                                                                 */
  //WM8978_RegWrite(REG_GPIO, 0);

  /********************************************
   * Output Switching
   ********************************************/
  /* REG_09                                                                                                 */
  //WM8978_RegWrite(REG_JACK_DETECT1, 0);

  /********************************************
   * Output Signal Path & Power Management
   ********************************************/
  /* REG_0A                                                                                                 */
  //WM8978_RegWrite(REG_DAC, 0);

  /********************************************
   * Analogue to Digital Converter
   ********************************************/
  /* REG_0B                                                                                                 */
  WM8978_RegWrite(REG_LEFT_DAC_VOL, DACVU | 0xFF);  /* 0xFF = 0dB, 0xFE = -0.5dB, 0xFD = -1dB, ...          */

  /********************************************
   * Output Signal Path
   ********************************************/
  /* REG_0C                                                                                                 */
  WM8978_RegWrite(REG_RIGHT_DAC_VOL, DACVU | 0xFF); /* 0xFF = 0dB, 0xFE = -0.5dB, 0xFD = -1dB, ...          */

  /********************************************
   * Output Switching
   ********************************************/
  /* REG_0D                                                                                                 */
  //WM8978_RegWrite(REG_JACK_DETECT2, 0);

  /********************************************
   * Analogue to Digital Converter
   ********************************************/
  /* REG_0E                                                                                                 */
  WM8978_RegWrite(REG_ADC, HPFEN | HPFAPP | HPFCUT_0 | ADCOSR128);
  /* REG_0F                                                                                                 */
  WM8978_RegWrite(REG_LEFT_ADC_VOL, ADCVU | 0xFF);  /* 0xFF = 0dB, 0xFE = -0.5dB, 0xFD = -1dB, ...          */
  /* REG_10                                                                                                 */
  WM8978_RegWrite(REG_RIGHT_ADC_VOL, ADCVU | 0xFF); /* 0xFF = 0dB, 0xFE = -0.5dB, 0xFD = -1dB, ...          */

  /********************************************
   * Output Signal Path
   ********************************************/
  /* REG_12                                                                                                 */
  //WM8978_RegWrite(REG_EQ1, EQ3DMODE_DAC | EQ1C_80HZ | 0x0C);
  /* REG_13                                                                                                 */
  //WM8978_RegWrite(REG_EQ2, EQ2BW_NARROW | EQ2C_230HZ | 0x0C);
  /* REG_14                                                                                                 */
  //WM8978_RegWrite(REG_EQ3, EQ3BW_NARROW | EQ3C_650HZ | 0x0C);
  /* REG_15                                                                                                 */
  //WM8978_RegWrite(REG_EQ4, EQ4BW_NARROW | EQ4C_1_8KHZ | 0x0C);
  /* REG_16                                                                                                 */
  //WM8978_RegWrite(REG_EQ5, EQ5C_5_3KHZ | 0x0C);
  /* REG_18                                                                                                 */
  //WM8978_RegWrite(REG_DAC_LIMITER1, LIMDCY_750US | LIMATK_94US);
  /* REG_19                                                                                                 */
  //WM8978_RegWrite(REG_DAC_LIMITER2, LIMLVL_N1DB | LIMBOOST_0DB);

  /********************************************
   * Analogue to Digital Converter
   ********************************************/
  /* REG_1B                                                                                                 */
  //WM8978_RegWrite(REG_NOTCH_FILTER1, 0);
  /* REG_1C                                                                                                 */
  //WM8978_RegWrite(REG_NOTCH_FILTER2, 0);
  /* REG_1D                                                                                                 */
  //WM8978_RegWrite(REG_NOTCH_FILTER3, 0);
  /* REG_1E                                                                                                 */
  //WM8978_RegWrite(REG_NOTCH_FILTER4, 0);

  /********************************************
   * Input Limiter Automatic Level Control
   ********************************************/
  /* REG_20                                                                                                 */
  WM8978_RegWrite(REG_ALC1, ALCSEL_BOTH_ON | ALCMAXGAIN_35_25DB | ALCMINGAIN_N12DB);
  /* REG_21                                                                                                 */
  WM8978_RegWrite(REG_ALC2, ALCHLD_0MS | ALCLVL_N12DBFS);
  /* REG_22                                                                                                 */
#if (SOURCE_TYPE_SEL == SOURCE_TYPE_VOICE)
  WM8978_RegWrite(REG_ALC3, ALCMODE_ALC | ALCDCY_3 | ALCATK_2);   // 8 kHz
#else
  WM8978_RegWrite(REG_ALC3, ALCMODE_ALC | ALCDCY_10 | ALCATK_6);  // 44.1 kHz
#endif
  /* REG_23                                                                                                 */
  WM8978_RegWrite(REG_NOISE_GATE, NGEN | NGTH_N75DB);

  /********************************************
   * Analogue Outputs
   ********************************************/
  /* REG_2B                                                                                                 */
  WM8978_RegWrite(REG_BEEP, INVROUT2);

  /********************************************
   * Input Signal Path
   ********************************************/
  /* REG_2C                                                                                                 */
  WM8978_RegWrite(REG_INPUT, MBVSEL_0_65AVDD | RIN2INPVGA | RIP2INPVGA | LIN2INPVGA | LIP2INPVGA);
  /* REG_2D                                                                                                 */
  WM8978_RegWrite(REG_LEFT_PGA_GAIN, INPPGAUPDATE | 0x10);
  /* REG_2E                                                                                                 */
  WM8978_RegWrite(REG_RIGHT_PGA_GAIN, INPPGAUPDATE | 0x10);
  /* REG_2F                                                                                                 */
  WM8978_RegWrite(REG_LEFT_ADC_BOOST, /* PGABOOSTL | */ L2_2BOOSTVOL_DISABLED | AUXL2BOOSTVOL_DISABLED);
  /* REG_30                                                                                                 */
  WM8978_RegWrite(REG_RIGHT_ADC_BOOST, /* PGABOOSTR | */ R2_2BOOSTVOL_DISABLED | AUXR2BOOSTVOL_DISABLED);

  /********************************************
   * Analogue Output
   ********************************************/
  /* REG_31                                                                                                 */
  WM8978_RegWrite(REG_OUTPUT, TSDEN | SPKBOOST);
  /* REG_32                                                                                                 */
  WM8978_RegWrite(REG_LEFT_MIXER, /* BYPLMIXVOL_6DB | BYPL2LMIX */ DACL2LMIX);
  /* REG_33                                                                                                 */
  WM8978_RegWrite(REG_RIGHT_MIXER, /* BYPRMIXVOL_6DB | BYPR2RMIX */ DACR2RMIX);
  /* REG_34                                                                                                 */
  WM8978_RegWrite(REG_LOUT1_VOL, HPVU | (0x39 + 0));    // +0 dB range from -57dB to +6dB
  /* REG_35                                                                                                 */
  WM8978_RegWrite(REG_ROUT1_VOL, HPVU | (0x39 + 0));    // +0 dB range from -57dB to +6dB
  /* REG_36                                                                                                 */
  WM8978_RegWrite(REG_LOUT2_VOL, SPKVU | (0x39 + 0));    // +0 dB range from -57dB to +6dB
  /* REG_37                                                                                                 */
  WM8978_RegWrite(REG_ROUT2_VOL, SPKVU | (0x39 + 0));    // +0 dB range from -57dB to +6dB
  /* REG_38                                                                                                 */
  //WM8978_RegWrite(REG_OUT3_MIXER, OUT3MUTE);
  /* REG_39                                                                                                 */
  //WM8978_RegWrite(REG_OUT4_MIXER, OUT4MUTE);
}

